app/views/posts/index.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = $1  [["post_id", 1]]
---
        <div class='col-1' style='background-color: #9FBD95'>
        <p class='my-5'><%= post.votes.count %> 🐸 </p>