app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "user_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 1], ["user_id", 2], ["text", "hhhhhiiiii"], ["created_at", "2018-05-26 01:38:25.715263"], ["updated_at", "2018-05-26 01:38:25.715263"]]
---
    def create
        @comment = Comment.new(comment_params)
        if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @comment = Comment.find(params[:id])
        if current_user.id == @comment.user_id
            @post = Post.find(params[:post_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
    def destroy
        @comment = Comment.find(params[:id])
        @id = @comment.post_id
        if current_user.id == @comment.user_id
            @comment.destroy