app/controllers/posts_controller.rb

    def index
        @posts = Post.all.sort_by { |post| post.votes.count }.reverse
---
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = $1  [["post_id", 1]]

    def create
        @post = Post.new(post_params)
        if @post.save
---
INSERT INTO "posts" ("user_id", "title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def edit
        @post = Post.find(params[:id])
        if current_user
            if current_user.id == @post.user_id
                @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def upvote
        @post = Post.find(params[:id])
        if current_user
            @post.votes.create
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("post_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["post_id", 1], ["created_at", "2018-05-26 02:38:47.245321"], ["updated_at", "2018-05-26 02:38:47.245321"]]